<a href="https://colab.research.google.com/github/birusolankar/Pyspark-Bigdata/blob/main/Pyspark_5_11_2024.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pyspark

In [ ]:
from pyspark.sql import SparkSession

In [ ]:
spark = SparkSession.builder.appName('5/11/2024').getOrCreate()

In [ ]:
ipl = spark.read.csv('/content/deliveries.csv', inferSchema = True, header = True)

In [ ]:
ipl.show(5)

+--------+------+-------------------+--------------------+----+----+---------+-----------+--------+-------------+---------+--------+-----------+-----------+------------+------------+----------+----------+----------------+--------------+-------+
|match_id|inning|       batting_team|        bowling_team|over|ball|  batsman|non_striker|  bowler|is_super_over|wide_runs|bye_runs|legbye_runs|noball_runs|penalty_runs|batsman_runs|extra_runs|total_runs|player_dismissed|dismissal_kind|fielder|
+--------+------+-------------------+--------------------+----+----+---------+-----------+--------+-------------+---------+--------+-----------+-----------+------------+------------+----------+----------+----------------+--------------+-------+
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   1|DA Warner|   S Dhawan|TS Mills|            0|        0|       0|          0|          0|           0|           0|         0|         0|            NULL|          NULL|   NULL|
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   2|DA Warner|   S Dhawan|TS Mills|            0|        0|       0|          0|          0|           0|           0|         0|         0|            NULL|          NULL|   NULL|
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   3|DA Warner|   S Dhawan|TS Mills|            0|        0|       0|          0|          0|           0|           4|         0|         4|            NULL|          NULL|   NULL|
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   4|DA Warner|   S Dhawan|TS Mills|            0|        0|       0|          0|          0|           0|           0|         0|         0|            NULL|          NULL|   NULL|
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   5|DA Warner|   S Dhawan|TS Mills|            0|        2|       0|          0|          0|           0|           0|         2|         2|            NULL|          NULL|   NULL|
+--------+------+-------------------+--------------------+----+----+---------+-----------+--------+-------------+---------+--------+-----------+-----------+------------+------------+----------+----------+----------------+--------------+-------+
only showing top 5 rows

In [ ]:
df = spark.read.csv('/content/Tutorial_4.csv', inferSchema = True, header = True)

In [ ]:
df.show(4)

+------+------------+------+----------+
|  Name|  Department|Salary|Experience|
+------+------------+------+----------+
|  Amit|Data Science| 25000|         5|
|Mahesh|    Big Data| 17000|         7|
|Ramesh|    Big Data| 17000|         2|
|Sudhir|         IOT| 12000|         1|
+------+------------+------+----------+
only showing top 4 rows

In [ ]:
df.show()

+------+----------------+------+----------+
|  Name|      Department|Salary|Experience|
+------+----------------+------+----------+
|  Amit|    Data Science| 25000|         5|
|Mahesh|        Big Data| 17000|         7|
|Ramesh|        Big Data| 17000|         2|
|Sudhir|             IOT| 12000|         1|
|Sudhir|        Big Data|  7000|         4|
| Sunny|    Data Science| 20000|         2|
| Sunny|        Big Data| 12000|         3|
|  Alka|Machine Learning| 30000|         4|
+------+----------------+------+----------+

In [ ]:
from pyspark.sql import functions as f

In [27]:
df.groupby('Department').agg(f.max('Salary')).show()

+----------------+-----------+
|      Department|max(Salary)|
+----------------+-----------+
|             IOT|      12000|
|Machine Learning|      30000|
|        Big Data|      17000|
|    Data Science|      25000|
+----------------+-----------+

In [30]:
df.groupby('Department').agg(f.min('Salary'), f.min('Experience')).show()

+----------------+-----------+---------------+
|      Department|min(Salary)|min(Experience)|
+----------------+-----------+---------------+
|             IOT|      12000|              1|
|Machine Learning|      30000|              4|
|        Big Data|       7000|              2|
|    Data Science|      20000|              2|
+----------------+-----------+---------------+

In [ ]:
df1 = spark.read.csv('/content/Tutorial_3.csv', inferSchema = True, header = True)

In [ ]:
df1.show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     NULL|  36|       8.0|  NULL|
|     NULL|  41|      NULL| 34000|
|     NULL|NULL|      NULL|  NULL|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

In [32]:
# selecting cloumns
df1.select('Name', 'Age').show(4)

+------+----+
|  Name| Age|
+------+----+
|  Amit|  22|
|  Amit|  22|
| Ankit|  25|
|Ashish|NULL|
+------+----+
only showing top 4 rows

In [33]:
df1.select(['Name', 'Salary']).show()

+---------+------+
|     Name|Salary|
+---------+------+
|     Amit| 12000|
|     Amit| 12000|
|    Ankit|  NULL|
|   Ashish| 15000|
|    Vijay| 17000|
|Sudarshan|  NULL|
|    Ketan| 23000|
|     NULL|  NULL|
|     NULL| 34000|
|     NULL|  NULL|
|     Ajit| 40000|
|     Ajit| 40000|
+---------+------+

In [38]:
# adding new column

df1.withColumn('New_Exp', df1['Experience']+2).show()

+---------+----+----------+------+-------+
|     Name| Age|Experience|Salary|New_Exp|
+---------+----+----------+------+-------+
|     Amit|  22|       1.5| 12000|    3.5|
|     Amit|  22|       1.5| 12000|    3.5|
|    Ankit|  25|      NULL|  NULL|   NULL|
|   Ashish|NULL|       1.0| 15000|    3.0|
|    Vijay|  29|      NULL| 17000|   NULL|
|Sudarshan|NULL|       5.0|  NULL|    7.0|
|    Ketan|  33|      NULL| 23000|   NULL|
|     NULL|  36|       8.0|  NULL|   10.0|
|     NULL|  41|      NULL| 34000|   NULL|
|     NULL|NULL|      NULL|  NULL|   NULL|
|     Ajit|  43|      10.0| 40000|   12.0|
|     Ajit|  43|      10.0| 40000|   12.0|
+---------+----+----------+------+-------+

In [40]:
# renaming column
df1.withColumnRenamed('Name', 'New_Name').show(4)
df1.show(4) # orginal dataframe is intact

+--------+----+----------+------+
|New_Name| Age|Experience|Salary|
+--------+----+----------+------+
|    Amit|  22|       1.5| 12000|
|    Amit|  22|       1.5| 12000|
|   Ankit|  25|      NULL|  NULL|
|  Ashish|NULL|       1.0| 15000|
+--------+----+----------+------+
only showing top 4 rows

+------+----+----------+------+
|  Name| Age|Experience|Salary|
+------+----+----------+------+
|  Amit|  22|       1.5| 12000|
|  Amit|  22|       1.5| 12000|
| Ankit|  25|      NULL|  NULL|
|Ashish|NULL|       1.0| 15000|
+------+----+----------+------+
only showing top 4 rows

In [42]:
df1.withColumnRenamed('Name', 'New_name').withColumnRenamed('Age', 'New_age').show(4)

+--------+-------+----------+------+
|New_name|New_age|Experience|Salary|
+--------+-------+----------+------+
|    Amit|     22|       1.5| 12000|
|    Amit|     22|       1.5| 12000|
|   Ankit|     25|      NULL|  NULL|
|  Ashish|   NULL|       1.0| 15000|
+--------+-------+----------+------+
only showing top 4 rows

In [49]:
# dropping a column

df1.drop('Age').show(4)
df.show(4)

+------+----------+------+
|  Name|Experience|Salary|
+------+----------+------+
|  Amit|       1.5| 12000|
|  Amit|       1.5| 12000|
| Ankit|      NULL|  NULL|
|Ashish|       1.0| 15000|
+------+----------+------+
only showing top 4 rows

+------+------------+------+----------+
|  Name|  Department|Salary|Experience|
+------+------------+------+----------+
|  Amit|Data Science| 25000|         5|
|Mahesh|    Big Data| 17000|         7|
|Ramesh|    Big Data| 17000|         2|
|Sudhir|         IOT| 12000|         1|
+------+------------+------+----------+
only showing top 4 rows

In [50]:
# dropping multiple columns
df1.drop('Age', 'Salary').show(4)
df1.show(4)

+------+----------+
|  Name|Experience|
+------+----------+
|  Amit|       1.5|
|  Amit|       1.5|
| Ankit|      NULL|
|Ashish|       1.0|
+------+----------+
only showing top 4 rows

+------+----+----------+------+
|  Name| Age|Experience|Salary|
+------+----+----------+------+
|  Amit|  22|       1.5| 12000|
|  Amit|  22|       1.5| 12000|
| Ankit|  25|      NULL|  NULL|
|Ashish|NULL|       1.0| 15000|
+------+----+----------+------+
only showing top 4 rows

In [46]:
from pyspark.sql.functions import lit

In [48]:
df1.withColumn('Bonus', lit('None')).show(5)

+------+----+----------+------+-----+
|  Name| Age|Experience|Salary|Bonus|
+------+----+----------+------+-----+
|  Amit|  22|       1.5| 12000| None|
|  Amit|  22|       1.5| 12000| None|
| Ankit|  25|      NULL|  NULL| None|
|Ashish|NULL|       1.0| 15000| None|
| Vijay|  29|      NULL| 17000| None|
+------+----+----------+------+-----+
only showing top 5 rows

In [54]:
df1.withColumn('Bonus', df1['Salary']*0.15).show(5)

+------+----+----------+------+------+
|  Name| Age|Experience|Salary| Bonus|
+------+----+----------+------+------+
|  Amit|  22|       1.5| 12000|1800.0|
|  Amit|  22|       1.5| 12000|1800.0|
| Ankit|  25|      NULL|  NULL|  NULL|
|Ashish|NULL|       1.0| 15000|2250.0|
| Vijay|  29|      NULL| 17000|2550.0|
+------+----+----------+------+------+
only showing top 5 rows

In [56]:
# find null values
df1.na.drop(how = 'any').show()
df1.na.drop().show()

+----+---+----------+------+
|Name|Age|Experience|Salary|
+----+---+----------+------+
|Amit| 22|       1.5| 12000|
|Amit| 22|       1.5| 12000|
|Ajit| 43|      10.0| 40000|
|Ajit| 43|      10.0| 40000|
+----+---+----------+------+

+----+---+----------+------+
|Name|Age|Experience|Salary|
+----+---+----------+------+
|Amit| 22|       1.5| 12000|
|Amit| 22|       1.5| 12000|
|Ajit| 43|      10.0| 40000|
|Ajit| 43|      10.0| 40000|
+----+---+----------+------+

In [58]:
df1.show()
df1.na.drop(how = 'all').show() # if all the rows contains null values in each column then that particular row will be deleted
df1.na.drop(how = 'any').show() # if any column contains null values that particular row will be dropped

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     NULL|  36|       8.0|  NULL|
|     NULL|  41|      NULL| 34000|
|     NULL|NULL|      NULL|  NULL|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     NULL|  36|       8.0|  NULL|
|     NULL|  41|      NULL| 34000|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

+----+---+----------+------+
|Name|Age|Experience|Salary|
+----+---+----------+------+
|Amit| 22|       1.5| 12000|
|Amit| 22|       1.5| 12000|
|Ajit| 43|      10.0| 40000|
|Ajit| 43|      10.0| 40000|
+----+---+----------+------+

In [61]:
# thresh -- this parameter shows how many columns should contain values in particular row
df1.show()
df1.na.drop(thresh = 2).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     NULL|  36|       8.0|  NULL|
|     NULL|  41|      NULL| 34000|
|     NULL|NULL|      NULL|  NULL|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     NULL|  36|       8.0|  NULL|
|     NULL|  41|      NULL| 34000|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

In [64]:
# thresh
df1.show()
df1.na.drop(thresh = 4).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     NULL|  36|       8.0|  NULL|
|     NULL|  41|      NULL| 34000|
|     NULL|NULL|      NULL|  NULL|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

+----+---+----------+------+
|Name|Age|Experience|Salary|
+----+---+----------+------+
|Amit| 22|       1.5| 12000|
|Amit| 22|       1.5| 12000|
|Ajit| 43|      10.0| 40000|
|Ajit| 43|      10.0| 40000|
+----+---+----------+------+

In [65]:
# subset-- it is used to drop values from the particular column
df1.show()
df1.na.drop(subset = ['Name']).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     NULL|  36|       8.0|  NULL|
|     NULL|  41|      NULL| 34000|
|     NULL|NULL|      NULL|  NULL|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+